#coding: utf-8

"""Генерируем файл orders.py с несколькими заказами на одну дату."""
#Imports {{{1
import random

#Global variables {{{1
Date = '16.06.2014'
times = {
    '1': ('10:00','10:15','10:30','10:45','11:00','11:15','11:30','11:45'),
    '2': ('12:00','12:20','12:40','13:00','13:20','13:40','14:00','14:20','14:40','15:00','15:20',
          '15:40','16:00','16:20','16:40','17:00','17:20','17:40','18:00','18:20','18:40'),
    '3': ('12:00','12:20','12:40','13:00','13:20','13:40','14:00','14:20','14:40','15:00','15:20',
          '15:40','16:00','16:20','16:40','17:00','17:20','17:40')
}
routes = ('1','2','3')
# Количество заказов
N = 6

# Action {{{1
F = open('orders.csv', 'w')

S = u"Дата;Время;Кол-во;Маршрут\n"
for n in xrange(N):
    d = Date
    r = random.choice(routes)
    t = random.choice(times[r])
    q = random.randint(1, 20)
    S += '%s;%s;%s;%s\n' % (d, t, q, r)

F.write(S.encode('utf-8'))
F.close()
